IDOK                                          = "確認"
IDCANCEL                                      = "取消"
IDAPPLY                                       = "套用"
IDCLOSE                                       = "結束"
IDDEFAULT                                     = "預設值"

ID_ADD                                        = "新增"
ID_DELETE                                     = "刪除"
ID_INSERT                                     = "插入"

ID_SEISMIC_FRAME_TYPE_SMF                     = "SMF"
ID_SEISMIC_FRAME_TYPE_IMF                     = "IMF"
ID_SEISMIC_FRAME_TYPE_OMF                     = "OMF"
ID_SEISMIC_FRAME_TYPE_DES                     = "DES"
ID_SEISMIC_FRAME_TYPE_DMO                     = "DMO"
ID_SEISMIC_FRAME_TYPE_DMI                     = "DMI"
ID_SEISMIC_WALL_TYPE_SMF                      = "特殊結構牆"
ID_SEISMIC_WALL_TYPE_IMF                      = "中級結構牆"
ID_SEISMIC_WALL_TYPE_OMF                      = "一般結構牆"

IDC_COMPRESSION_REBAR                         = "壓力鋼筋"
IDC_DO_NOT_CONSIDER                           = "不考慮"
IDC_CONSIDER                                  = "考慮"

IDC_DPLUS_INP_BTN_APPLY                       = "套用"
IDC_DPLUS_INP_BTN_CHECK                       = "檢核"
IDC_DPLUS_INP_BTN_DESIGN                      = "設計"
IDC_DPLUS_INP_BTN_REPORT                      = "報表 ..."
IDC_DPLUS_INP_BTN_PRINT                       = "列印 ..."
IDC_DPLUS_INP_BTN_SAVE                        = "儲存 ..."

IDC_DPLUS_INP_BTN_SEL_ALL                     = "全選"
IDC_DPLUS_INP_BTN_SEL_NONE                    = "取消"
IDC_DPLUS_INP_BTN_SEL_INVERT                  = "反選"
IDC_DPLUS_INP_BTN_EXCEL_FILE                  = "Excel檔 ..."
IDC_DPLUS_INP_BTN_AUTORESIZE                  = "調整間距"
IDS_SELECT_MEMBER                             = "選取構件"
IDS_IMPORT_SECTION                            = "匯入斷面"

IDC_DGN_BTN_EVAL_MEMB                         = "評估構件"
IDC_DGN_BTN_EVAL_TOTL                         = "評估建物 ..."
IDC_DGN_BTN_EXCEL_OUT                         = "Excel檔 ..."
IDC_DGN_BTN_AUTO_SIZE                         = "調整間距"

IDC_DPLUS_LABEL_MEMB_NAME                     = "構件名稱"
IDC_DPLUS_FRAME_GENERAL                       = "一般事項"
IDC_DPLUS_LABEL_USE_TYPE                      = "同步套用於 "

IDS_DOUBLE_CLICK_TO_ZOOM                      = "雙擊放大"
IDS_DOUBLE_CLICK_TO_CLOSE                     = "雙擊關閉"

IDS_MOMENT                                    = "彎矩"
IDS_SHEAR                                     = "剪力"
IDS_BENDING_MOMENT                            = "彎矩"
IDS_SHEAR_FORCE                               = "剪力"
IDS_MATERIAL                                  = "材料"
IDS_SECTION                                   = "斷面"
IDS_STUD                                      = "剪力釘"
IDS_STUD_BOLT                                 = "剪力釘"
IDS_RIB                                       = "肋板"
IDS_RIB_PLATE                                 = "肋板"

/////// IDD_MAIN_LCOM_DLG
IDD_MAIN_LCOM_DLG                             = "載重組合"
IDC_MAIN_LCOM_FRAME                           = "選擇構件清單"
IDC_MAIN_LCOM_SYNC_CHK                        = "與主程式同步"
IDC_MAIN_LCOM_SYSTEM_STC                      = "系統"
IDC_MAIN_LCOM_MEMBER_STC                      = "種類"
IDC_MAIN_LCOM_ELEM_STC                        = "構件"
IDC_MAIN_LCOM_SYNC_LBL                        = "(取消勾選 : 維持當前設定)"
IDC_MAIN_LCOM_LBL_OPACITY                     = "視窗透明度"

/////// IDD_MAIN_WORKTREE_DOCK_PAGE
IDC_MAIN_ADD_MEMB_GROUP                       = "新增構件"
IDC_MAIN_LIST_SYSTEM_STC                      = "構造系統"
IDC_MAIN_LIST_MEMBER_STC                      = "構件類型"
IDC_MAIN_LIST_NAME_STC                        = "名稱"
IDC_MAIN_LIST_ADD_BUTTON                      = "新增構件"
IDC_MAIN_LIST_ADD_IMPORT                      = "匯入"
IDC_MAIN_LIST_IMPORT_GNX                      = "Import from GEN NX"
IDC_MAIN_LIST_IMPORT_GEN                      = "Import from Gen"
IDC_MAIN_LIST_IMPORT_ADS                      = "Import from ADS"
IDC_MAIN_LIST_EXP_BUTTON                      = "Export"
IDC_MAIN_LIST_OPT_BUTTON                      = "選項..."
IDC_MAIN_LIST_ELEM_STC                        = "構件編號"
IDC_MAIN_LIST_NODE_STC                        = "節點編號"
IDC_MAIN_LIST_NOTE_BEAM                       = "All RC Beam data will be imported."
IDC_MAIN_LIST_NOTE_COLM                       = "All RC Column data will be imported."
IDC_MAIN_LIST_NOTE_WALL                       = "將匯入所有牆資料"
IDC_MAIN_LIST_CHK_KEEP                        = "載入斷面與鋼筋資料"
IDC_MAIN_LIST_DEL_BATCH_BEAM                  = "Existing batch beam data will be removed.\n\nDo you want to continue?"
IDC_MAIN_LIST_DEL_BATCH_COLM                  = "Existing batch column data will be removed.\n\nDo you want to continue?"
IDC_MAIN_LIST_DEL_BATCH_WALL                  = "Existing batch wall data will be removed.\n\nDo you want to continue?"

/////// IDD_MAIN_DRAW_DLG
IDC_DWG_LIST_BTN_CREATE                       = "建立"
IDC_DWG_LIST_BTN_SAVE                         = "另存新檔..."
IDC_DWG_LIST_BTN_BLOCKPRINT                   = "列印"

/////// IDD_MAIN_PROTECTION_EX_OPT_KR_DLG
IDC_STATIC_COMMENT                            = "請選擇程式功能選項"
IDC_PRODUCT_OPTION_STC                        = "選項 "
IDC_OPTION_SELECT_ALL                         = "全選"
IDC_OPTION_SELECT_NONE                        = "全不選"
IDC_LBC_LOCKOPT_UPDATEBTN                     = "更新"
IDC_LBC_LOCKOPT_KR_CHK1                       = "鋁構造"
IDC_LBC_LOCKOPT_KR_CHK2                       = "Corrugated Web Beam"
IDC_LBC_LOCKOPT_KR_CHK3                       = "Data Export ( Gen )"

/////// IDD_MAIN_PROTECTION_EX_OPT_US_DLG
IDC_LBC_LOCKOPT_US_CHK1                       = "排除美國規範"
IDC_LBC_LOCKOPT_US_CHK2                       = "歐洲規範"
IDC_LBC_LOCKOPT_US_CHK3                       = "印度規範"
IDC_LBC_LOCKOPT_US_CHK4                       = "韓國規範"
IDC_LBC_LOCKOPT_US_CHK5                       = "鋁構造規範"
IDC_LBC_LOCKOPT_US_CHK6                       = "批次設計"

/////// IDD_MAIN_PROTECTION_EX_OPT_CH_DLG
IDC_LBC_LOCKOPT_CH_CHK1                       = "美國規範"
IDC_LBC_LOCKOPT_CH_CHK2                       = "歐洲規範"
IDC_LBC_LOCKOPT_CH_CHK3                       = "其他規範"
IDC_LBC_LOCKOPT_CH_CHK4                       = "批次設計"

/////// IDD_MAIN_PROTECTION_EX_DLG
IDD_MAIN_PROTECTION_EX_DLG                    = "登錄序號"
IDC_MAIN_RD1                                  = "網路授權"
IDC_MAIN_RD3                                  = "硬體鎖授權"
IDC_MAIN_RD4                                  = "Period Lock"
IDC_MAIN_REG_FRM_LICENSE                      = "授權認證資料"
IDC_MAIN_STATIC_1                             = "帳號"
IDC_MAIN_STATIC_2                             = "密碼"
IDC_MAIN_STATIC_US_PK                         = "序號"
IDC_MAIN_PROXY_SERVER_CHK                     = "使用Proxy Server"
IDC_MAIN_PROTECT_OPTBTN                       = "選擇功能選項"
IDC_MAIN_PROTECT_MEMBERSHIP_BTN               = "建立新帳戶"
IDC_MAIN_STATIC_KEYNUMBER                     = "硬體鎖編號 "
IDC_MAIN_STATIC_KEYTYPE                       = "硬體鎖類型 "
IDC_MAIN_STATIC_PROTOCOL                      = "通訊協定 "
IDC_MAIN_SERVER_NAME_CHK                      = "伺服器名稱或IP位址"
IDC_MAIN_STATIC_3                             = "Lock Type"
IDC_MAIN_RD2                                  = "S/W Lock Authentication"
IDC_MAIN_STATIC_COMMENT                       = " MUSS Identification"
IDC_MAIN_STATIC_4                             = "Key Number"
IDC_MAIN_SWL_HARDWAREID_BT                    = "Hardware ID"
IDC_MAIN_SWL_FIXCLOCK_BT                      = "Fix clock problem"
IDC_MAIN_STATIC_MODS1                         = "MIDAS On Demand Service"
IDC_MAIN_STATIC_MODS2                         = "Welcome to"
IDC_MAIN_STATIC_MODS3                         = "[ Design+ Ver.100 ]"
IDC_MAIN_CHK_STARTUP                          = "開啟時不再顯示此視窗"
IDC_MAIN_REG_RESET_BTN                        = "重新設定"
IDC_MAIN_PERIOD_KEY_NUM_STC                   = "Key Number"
IDC_MAIN_PERIOD_HARD_ID_BTN					  = "Hardware ID"

/////// IDD_MAIN_PROXY_SERVER_DLG
IDC_MAIN_PROXY_SERVER_FRM                     = "Proxy Server Setting"
IDC_RDO_AUTO_DETECT                           = "Auto Detect"
IDC_RDO_MANUAL_SET                            = "Direct Setting"
IDC_MAIN_PROXY_ADDRESS_STC                    = "Proxy Server Address (ex: Proxy.midasit.com or IP address) and Port"
IDC_MAIN_PROXY_ADDRESS_STC2                   = "Address:"
IDC_MAIN_PROXY_PORT_STC                       = "Port:"
IDC_MAIN_PROXY_USER_INFO_CHK                  = "Need user name and password to access proxy server"
IDC_MAIN_PROXY_USERNAME_STC                   = "User Name:"
IDC_MAIN_PROXY_PASSWORD_STC                   = "Password:"

/////// IDD_MAIN_PERIOD_HARDWAREID
IDD_MAIN_PERIOD_HARDWAREID                    = "Hardware ID"

/////// IDD_MAIN_REORDER_MEMBER_LIST_DLG
IDD_MAIN_REORDER_MEMBER_LIST_DLG              = "批次列印順序"
IDC_MAIN_LIST_MEMBER_FRM                      = "構件清單"
IDC_MAIN_LIST_MEMB_LIST_FRM                   = "構件清單"
IDC_MAIN_REORDER_SORT_BTN                     = "排序"
IDC_MAIN_LIST_MEMB_SORT_FRM                   = "排序後構件清單"
IDC_MAIN_REORDER_UP_BTN                       = "向上"
IDC_MAIN_REORDER_DN_BTN                       = "向下"
IDC_MAIN_REORDER_APPLY_BTN                    = "套用"

/////// IDD_MAIN_WORKTREE_GROUP
IDD_MAIN_WORKTREE_GROUP                       = "構件群組"
IDC_GROUP_ADD_BTN                             = "新增"
IDC_GROUP_CPY_BTN                             = "複製"
IDC_GROUP_MOD_BTN                             = "修改"
IDC_GROUP_DEL_BTN                             = "刪除"
IDC_GROUP_UP_BTN                              = "向上"
IDC_GROUP_DOW_BTN                             = "向下"
IDC_GROUP_GR_ALL_BTN                          = "全選"
IDC_GROUP_GR_NON_BTN                          = "全不選"
IDC_GROUP_GR_IVT_BTN                          = "反選"
IDC_GROUP_DB_ALL_BTN                          = "全選"
IDC_GROUP_DB_NON_BTN                          = "全不選"
IDC_GROUP_DB_IVT_BTN                          = "反選"
IDC_GROUP_FRM_GROUP_LIST                      = "全組清單"
IDC_GROUP_FRM_MEMB_GROUP                      = "構件於群組"
IDC_GROUP_FRM_MEMB_DB                         = "構件於資料庫"
IDC_GROUP_FRM_PROPERTY                        = "屬性"
IDC_GROUP_LBL_PROP_NAME                       = "名稱"
IDC_GROUP_LBL_PROP_APPLY                      = "群組新增至"
IDC_GROUP_LBL_PROP_DESC                       = "描述"
IDC_GROUP_DB_CHK_NONGROUPONLY                 = "僅非群組"

/////// IDD_MAIN_STR_CONVERT_DLG
IDD_MAIN_STR_CONVERT_DLG                      = "String Converter ( ini File Generator )"
IDC_STR_CONVERT_FRM_FLDR                      = "Folder for Files"
IDC_STR_CONVERT_LBL_FLDH                      = ".h File"
IDC_STR_CONVERT_LBL_FLDI                      = ".ini File"
IDC_STR_CONVERT_FRM_OPTN                      = "Convert Option"
IDC_STR_CONVERT_CHK_AUTOTAB                   = "Automatic Tab Position"
IDC_STR_CONVERT_LBL_TABS                      = "Align Position ( Tab Number )"
IDC_STR_CONVERT_CHK_BLANK                     = "Remove Blank Lines."
IDC_STR_CONVERT_CHK_CMMNT                     = "Remove Comments."
IDC_STR_CONVERT_BTN_CNVRT                     = "Convert String"

/////// IDD_MAIN_STR_ALIGN_DLG
IDD_MAIN_STR_ALIGN_DLG                        = "String Aligner"
IDC_STR_ALIGN_FRM_FLDR                        = "Folder for ini Files"
IDC_STR_ALIGN_LBL_FLDB                        = "Before Align"
IDC_STR_ALIGN_LBL_FLDA                        = "After Align"
IDC_STR_ALIGN_FRM_OPTN                        = "Align Option"
IDC_STR_ALIGN_CHK_AUTOTAB                     = "Automatic Tab Position"
IDC_STR_ALIGN_LBL_TABS                        = "Align Position ( Tab Number )"
IDC_STR_ALIGN_CHK_BLANK                       = "Remove Blank Lines."
IDC_STR_ALIGN_CHK_CMMNT                       = "Remove Comments."
IDC_STR_ALIGN_BTN_ALIGN                       = "Align String"

/////// IDD_MAIN_STR_COPY_DLG
IDD_MAIN_STR_COPY_DLG                         = "Design Engine String File Copy Tool"
IDC_STR_COPY_FRM_FLDR                         = "Folder for Files"
IDC_STR_COPY_LBL_FLD_FR                       = "Design Engine Source Folder"
IDC_STR_COPY_LBL_FLD_TO                       = "Target Folder for INI Files"
IDC_STR_COPY_FRM_LANG                         = "Sub-fix for Language"
IDC_STR_COPY_LBL_LANG_EN                      = "English"
IDC_STR_COPY_LBL_LANG_KR                      = "Korean"
IDC_STR_COPY_LBL_LANG_CH                      = "Chinese"
IDC_STR_COPY_LBL_LANG_JP                      = "Japanese"
IDC_STR_COPY_LBL_LANG_RU                      = "Russian"
IDC_STR_COPY_LBL_LANG_TW                      = "Taiwanese"
IDC_STR_COPY_BTN_COPY                         = "Copy Files"
